Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier.GroupingType Property
 Gets or sets the grouping type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarPropertyModifier.GroupingTypeEnum? GroupingType { get; set; }
Public Property GroupingType As RebarPropertyModifier.GroupingTypeEnum?
	Get
	Set
Property Value
Type: Nullable<RebarPropertyModifier.GroupingTypeEnum>
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace